In [2]:
import pandas as pd
pd.read_csv('C:/data/수원_기상자료_test/기온강수/수원_기온.csv')

            YMD  TM   TEMP  SEQ
0      20230101   1   2.10  NaN
1      20230101   2  -0.20  NaN
2      20230101   3  -2.25  NaN
3      20230101   4  -3.20  NaN
4      20230101   5  -4.10  NaN
...         ...  ..    ...  ...
10345  20251031   6  11.65  NaN
10346  20251031   7  11.65  NaN
10347  20251031   8  10.70  NaN
10348  20251031   9   9.35  NaN
10349  20251031  10  12.00  NaN

[10350 rows x 4 columns]

In [5]:
df = pd.read_csv('C:/data/수원_기상자료_test/기온강수/수원_기온.csv')

In [7]:
import python-oracledb

SyntaxError: invalid syntax (3316723225.py, line 1)